package Homework;

public class Main_HW5_1 {
    public static void main(String[] args) {

        /* Pflfxf ^ Пусть есть две переменные целого типа a и b.
           Написать программу, печатающую true если значение хотя бы одной из этих
           переменных равно 10
        */
        int a = 9;
        int b = 1;
        /*

        if ( a == 10 || b == 10) {
            System.out.println(True);
        }

         */
        System.out.println(a == 10 || b == 10);
    }
}
